<a href="https://colab.research.google.com/github/jnelly79/Colorado_Solar_Installation_Adoption_Rates_DS/blob/master/data_cleaning/cleaning_the_solar_data.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
# Import Pandas and re
import pandas as pd
import re

In [ ]:
# Load random address solar data.
df = pd.read_csv('/content/drive/My Drive/datasets/data_practicum/random_address_solar_data3.csv')

In [ ]:
# Display dataframe head.
df.head()

   Unnamed: 0  Unnamed: 0.1  ... 20_year_cost_without_solar 20_year_save
0           0             0  ...                        NaN          NaN
1           1             1  ...                    $23,706       $4,171
2           2             2  ...                    $23,250         $133
3           3             3  ...                        NaN          NaN
4           4             4  ...                    $23,250       $5,297

[5 rows x 13 columns]

In [ ]:
# Display dataframe shape.
df.shape

(1741, 13)

In [ ]:
# Drop na values.
df = df.dropna(axis=0)

In [ ]:
# Display dataframe shape again.
df.shape

(741, 13)

In [ ]:
# Display duplicate values.
df['addresses'].value_counts()

1034 29th St, Denver, CO 80205              7
3717 Inca St, Denver, CO 80211              3
7035 S Spruce Dr E, Centennial, CO 80112    2
2807 Alan St, Fort Collins, CO 80524        2
1301 27th Ave, Greeley, CO 80634            2
                                           ..
1763 S Moline Ct, Aurora, CO 80012          1
5237 E Dakota Ave, Denver, CO 80246         1
4786 Clayton St, Denver, CO 80216           1
81010                                       1
81303                                       1
Name: addresses, Length: 695, dtype: int64

In [ ]:
# Convert dataframe column 'addresses' to Dtype(str).
df['addresses'] = df['addresses'].astype(str)

In [ ]:
# Remove the zipcode values that got mixed into the addresses.
df = df[df['addresses'].map(len) > 5]

In [ ]:
# Display dataframe shape.
df.shape

(546, 13)

In [ ]:
# Display duplicates.
df['addresses'].value_counts()

1034 29th St, Denver, CO 80205                 7
3717 Inca St, Denver, CO 80211                 3
4331 E Maplewood Way, Centennial, CO 80121     2
2206 E 23rd Ave, Denver, CO 80205              2
13095 Marion Dr, Thornton, CO 80241            2
                                              ..
10071 E 26th Ave, Denver, CO 80238             1
172 E Mikado Dr, Colorado Springs, CO 80919    1
4940 Nolte Dr, Colorado Springs, CO 80916      1
2924 W Kiowa St, Colorado Springs, CO 80904    1
1620 Egret Way, Superior, CO 80027             1
Name: addresses, Length: 500, dtype: int64

In [ ]:
# Drop duplicates.
df = df.drop_duplicates(['addresses'])

In [ ]:
# Display dataframe shape.
df.shape

(500, 13)

In [ ]:
# Create function to remove string from value columns.
def remove_str(x):
  string = re.sub('\D', '', x)
  return string

In [ ]:
# Apply remove_str function to all the columns with numbers and string mixed.
df['sun_hours'] = df['sun_hours'].apply(remove_str)
df['sqft'] = df['sqft'].apply(remove_str)
df['upfront_cost'] = df['upfront_cost'].apply(remove_str)
df['20_year_pay'] = df['20_year_pay'].apply(remove_str)
df['state_fed_incentives'] = df['state_fed_incentives'].apply(remove_str)
df['20_year_cost_with_solar'] = df['20_year_cost_with_solar'].apply(remove_str)
df['20_year_cost_without_solar'] = df['20_year_cost_without_solar'].apply(remove_str)
df['20_year_save'] = df['20_year_save'].apply(remove_str)

In [ ]:
# Display the dataframe head.
df.head()

   Unnamed: 0  Unnamed: 0.1  ... 20_year_cost_without_solar 20_year_save
1           1             1  ...                      23706         4171
2           2             2  ...                      23250          133
4           4             4  ...                      23250         5297
5           5             5  ...                      23250         3079
6           6             6  ...                      23250         4608

[5 rows x 13 columns]

In [ ]:
# Create functionto remove the extra values in the size_for_full_cvg column.
def remove_extra(x):
    l = re.search('(.+?)kW',x)
    if l:
          found = l.group(1)
          return found
    else:
        return None

In [ ]:
# Apply function to size_for_full_cvg column.
df['size_for_full_cvg'] = df['size_for_full_cvg'].apply(remove_extra)

In [ ]:
# Display dataframe head.
df.head()

   Unnamed: 0  Unnamed: 0.1  ... 20_year_cost_without_solar 20_year_save
1           1             1  ...                      23706         4171
2           2             2  ...                      23250          133
4           4             4  ...                      23250         5297
5           5             5  ...                      23250         3079
6           6             6  ...                      23250         4608

[5 rows x 13 columns]

In [ ]:
# Export cleaned data into csv or excel file.
df.to_excel('/content/drive/My Drive/datasets/data_practicum/random_address_solar_data3.xlsx', sheet_name='cleaned')